MONITOR_OBJECT_TYPE = {
    "Device": "设备",
}

MONITOR_OBJECT = {
    "Switch": "交换机",
}

MONITOR_OBJECT_PLUGIN = {
    "Switch": {

    }
}

MONITOR_OBJECT_METRIC_GROUP = {
    "Switch": {

    }
}

MONITOR_OBJECT_METRIC = {
    "Switch": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    }
}

LANGUAGE_DICT = {
    "MONITOR_OBJECT_TYPE": MONITOR_OBJECT_TYPE,
    "MONITOR_OBJECT": MONITOR_OBJECT,
    "MONITOR_OBJECT_PLUGIN": MONITOR_OBJECT_PLUGIN,
    "MONITOR_OBJECT_METRIC_GROUP": MONITOR_OBJECT_METRIC_GROUP,
    "MONITOR_OBJECT_METRIC": MONITOR_OBJECT_METRIC,
}
